Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/health_services_for_older_people/nursing_homes_support_scheme_1.html.txt.tmx
Source language: en
Languages: ga

source: The HSE pays the balance of the cost of care to the private nursing home
ga: Íocann an FSS iarmhéid an chostais chúraim leis an teach altranais príobháideach

source: Financial support will only be paid where a nursing home is identified as being appropriate to your needs
ga: Ní íocfar tacaíocht airgeadais ach sa chás go meastar go n-oireann an teach altranais do do riachtanais

source: Existing nursing home residents
ga: Daoine atá anois ina gcónaí i dtithe altranais

source: You will not be affected if you were already in a public nursing home or a HSE contract bed in a private nursing home before the Nursing Homes Support Scheme started
ga: Ní bheidh aon tionchar aige seo ort má bhí tú i dteach altranais poiblí nó i leaba chonartha FSS cheana féin i dteach altranais príobháideach sular thosaigh an Scéim Tacaíochta do Thithe Altranais

source: You can contribute to your care on the same basis as before
ga: Féadfaidh tú cur le do chúram ar an mbonn céanna faoi mar a rinne tú roimhe seo

source: If you were already in an approved private nursing home before the start of the scheme you can transfer to the Nursing Homes Support Scheme or keep your existing payment arrangements
ga: Má bhí tú i dteach faofa altranais sular thosaigh an scéim, féadfaidh tú aistriú chuig an Scéim Tacaíochta do Thithe Altranais nó do shocruithe reatha íocaíochta a choimeád

source: If you have been resident in the nursing home for three years or more, the financial assessment will only be based on income and assets other than your principal residence (and your farm/business in certain circumstances), that is, the ‘three year’ cap will apply
ga: Má tá cónaí ort sa teach altranais ar feadh trí bliana ar a laghad, bunófar an measúnú airgeadais ar do theacht isteach agus do shócmhainní seachas ar do phríomháit chónaithe (agus ar d'fheirm/do ghnóthas i gcásanna áirithe), is é sin le rá, beidh feidhm ag an ‘uasteorainn trí bliana’

source: If your private nursing home is not approved for this scheme you can retain your current subvention arrangements or you can opt to apply for the scheme and change to a nursing home which is on the list
ga: Muna bhfuil do theach altranais príobháideach ceadaithe don scéim seo tá sé de rogha agat leanúint de bheith ag fáil an fhóirdheontas atá á fháil agat faoi láthair nó iarratas a dhéanamh ar an scéim agus aistriú go teach altranais atá ar an liosta

source: If you were in an approved private nursing home before the start of the scheme, you do not need to apply for a Care Needs Assessment
ga: Má bhí tú i dteach faofa príobháideach altranais sular thosaigh an scéim, ní gá duit iarratas a dhéanamh ar Mheasúnacht ar Riachtanais Chúraim

source: You can commence the process by applying for the Financial Assessment
ga: Féadfaidh tú tús a chur leis an bpróiseas trí iarratas a dhéanamh ar an Measúnacht Airgeadais

source: You can fill in the application form yourself, or ask someone else to help to fill it in
ga: Is féidir leat an fhoirm iarratais a chomhlánú tú féin, nó iarraidh ar dhuine éigin eile cabhrú leat í a chomhlánú

source: If a person has reduced mental capacity, then a Specified Person (see 'Further information' below) can apply on their behalf
ga: Má tá cumas meabhrach laghdaithe agat, is féidir le Duine Sonraithe í a chomhlánú ar do shon

source: Applying on behalf of someone else
ga: Ag déanamh iarratais thar ceann duine éigin eile

source: If the applicant is not able to apply his/herself, a Specified Person can act on his/her behalf for Steps 1 and 2 of the application process
ga: Munar féidir leis an iarratasóir an t-iarratas a dhéanamh é/í féin, féadfaidh Duine Sonraithe an t-iarratas a dhéanamh ar a s(h)on, i gcás Céimeanna 1 agus 2 den phróiseas iarratais

source: Only a court appointed Care Representative (see 'Further information' below) can act on the applicant’s behalf for the Nursing Home Loan
ga: Ní féidir ach le hIonadaí Cúraim arna cheapadh ag cúirt gníomhú thar ceann iarratasóra i gcás na hIasachta Teach Altranais

source: After you send in the application form
ga: Tar éis duit an fhoirm iarratais a sheoladh isteach

source: When the Care Needs and Financial Assessments have been completed, the HSE will write to you and inform you of your contribution to care, and your eligibility for State support and the Nursing Home Loan (if applicable)
ga: Nuair a bheidh an Measúnú ar Riachtanais Chúraim agus an Measúnú Airgeadais críochnaithe, scríobhfaidh an FSS chugat ag insint duit an ranníocaíocht a bheith le híoc agat i leith an chúraim, agus cibé an bhfuil tú i dteideal tacaíochta Stáit agus na hIasachta Teach Altranais (más infheidhme)

source: At this stage you will also be provided with the list of nursing homes that are participating in the scheme. This list will include public nursing homes, voluntary nursing homes and approved private nursing homes
ga: Ag an gcéim seo cuirfear liosta ar fáil duit de na tither altranais atá rannpháirteach sa scéim, idir thithe altranais poiblí, thithe altranais deonacha agus thithe altranais príobháideacha ceadaithe

source: You may choose any nursing home from the list subject to the following conditions:
ga: Féadfaidh tú aon teach altranais ar an liosta a roghnú faoi réir na gcoinníollacha seo a leanas:

source: • The home must have a place for you
ga: • ní mór go mbeadh áit ag an teach altranais duit, agus

source: • The home must be able to cater for your particular needs
ga: • ní mór don teach altranais a bheith oiriúnach chun freastal do do riachtanais

source: The nursing home will have to carry out an assessment to determine whether it can meet your particular needs
ga: Beidh ar an teach altranais measúnú a dhéanamh féachaint an bhfreastalóidh sé do na riachtanais atá agat

source: Your choice of nursing home is not connected in any way to the level of your contribution to care
ga: Ní bheidh aon bhaint idir an rogha a dhéanfaidh tú i measc tithe altranais agus leibhéal do ranníocaíochta i leith do chúraim

source: Since 1 October 2011 the date of payment of State support and ancillary State support (nursing home loan) will be paid either from the date that the application is approved, or date of admission to the nursing home whichever is the later
ga: Ón 1 Deireadh Fómhair 2011 i leith, íocfar tacaíocht Stáit agus tacaíocht choimhdeach Stáit (iasacht do theach altranais) ón dáta a cheadaítear an t-iarratas, nó ón dáta a thugtar cead isteach chuig an teach altranais, pé ceann ba dhéanaí

source: (People who applied before 1 October 2011 received the payment from the date of application or the date of admission to the nursing home whichever was the later.)
ga: Fuair daoine a rinne iarratas roimh an 1 Deireadh Fómhair 2011 an íocaíocht ó dháta an iarratais nó ó dháta an cheada isteach chuig an teach altranais, pé ceann ba dhéanaí

source: Paying your contribution If you select a public or voluntary nursing home, you will pay your contribution to the HSE or voluntary nursing home as appropriate each week and the State will pay the balance on your behalf
ga: Má roghnaíonn tú teach altranais poiblí nó deonach, íocfaidh tú do ranníocaíocht leis an FSS nó leis an teach altranais dheonach faoi mar is cuí gach seachtain agus íocfaidh an Stát an t-iarmhéid ar do shon

source: If you select an approved private nursing home, you will pay your contribution to the nursing home provider each week and the State will pay the balance on your behalf
ga: Má roghnaíonn tú teach altranais príobháideach, íocfaidh tú an ranníocaíocht chuig an soláthraí teach altranais gach seachtain agus íocfaidh an Stát an t-iarmhéid ar do shon

source: You can download an application form (pdf)
ga: Is féidir foirm iarratais (pdf) a íoslódáil

source: They are also available from any health care setting in your area, including your Local Health Office and hospitals
ga: Tá foirmeacha iarratais ar fáil chomh maith i ngach suíomh cúraim shláinte i do cheantar, agus an Oifig Sláinte Áitiúil agus ospidéil san áireamh

source: There is more information on the scheme provided online by the Department of Health and HSE
ga: Gheobhaidh tú tuilleadh eolais mar gheall ar an scéim ar láithreán gréasáin na Roinne Sláinte:

source: These information pages include links to download the following documents:
ga: Treoir ghearr ar an Scéim Tacaíochta do Thithe Altranais(pdf)

source: • Quick Guide on the Nursing Homes Support Scheme (pdf)
ga: Leabhrán Eolais ar an Scéim Tacaíochta do Thithe Altranais (pdf)

source: • Information Booklet on the Nursing Homes Support Scheme (pdf)
ga: Ceisteanna Coitianta ar an Scéim Tacaíochta do Thithe Altranais (pdf)

source: If you have any questions you can contact your local Nursing Homes Support Office or contact the HSE Infoline on Callsave 1850 24 1850 or on (041) 685 0300
ga: nó cuir glao an Oifig Tacaíochta do Thithe Altranais nó cuir glao ar Líne Eolais an FSS ar 1850 24 1850 nó (041) 685 0300

source: Appeals: The HSE will inform you of the appeals process and provide details of your local Appeals Office when it writes to you to inform you of the outcome of your Care Needs and Financial Assessments
ga: Achomhairc: Cuirfidh an FSS scéala chugat mar gheall ar an bpróiseas achomhairc mar aon le sonraí d'Oifig Achomhairc áitiúil nuair a scríobhann sé chugat le toradh an Mheasúnaithe ar Riachtanais Chúraim agus an Mheasúnaithe Airgeadais

source: If, for example, your Care Needs Assessment found that you did not need long-term nursing home care you can appeal the decision to your local Appeals Office
ga: Mar shampla, má fuair an Measúnú ar Riachtanais Chúraim nach raibh cúram fadtéarmach i dteach altranais de dhíth ort, féadfaidh tú an cinneadh sin a achomharc chuig an Oifig Achomhairc áitiúil

source: Reviews: Any Care Needs Assessment can be reviewed six months after a previous assessment or earlier if either:
ga: Athbhreithniú: Is féidir aon Mheasúnú ar Riachtanais Chúraim a athbhreithniú tar éis tréimhse sé mhí nó níos luaithe más amhlaidh:

source: • The HSE is satisfied that there has been a material change in your health or circumstances or
ga: • go bhfuil an FSS sásta go bhfuil athrú ábhartha ar do shláinte nó ar do chúinsí nó

source: • A registered medical practitioner states that in his/her opinion there has been a material change in your health or circumstances since your most recent care needs assessment
ga: • má deir lia-chleachtóir cláraithe, ina t(h)uairim, go bhfuil athrú ábhartha ar do shláinte nó ar do chúinsí ó rinneadh an measúnú is déanaí ar do riachtanais chúraim

source: Reviews are carried out by your local Nursing Home Support Office and you should contact them if you want to have your Care Needs or Financial Assessment reviewed
ga: Déanann an Oifig Tacaíochta do Thithe Altranais áitiúil an t-athbhreithniú agus ba cheart duit teagmháil a dhéanamh leo má theastaíonn uait go ndéanfaí athbhreithniú ar do Mheasúnú ar Riachtanais Chúraim nó ar do Mheasúnú Airgeadais

source: Once the HSE has made a decision regarding the review, you will be notified of the decision and the reasons for the decision, in writing, within 10 working days
ga: Nuair a bheidh cinneadh déanta ag an FSS maidir le hathbhreithniú, cuirfear an cinneadh in iúl duit mar aon leis na cúiseanna leis an gcinneadh, i scríbhinn, laistigh de dheich lá oibre

source: Role of the Specified Person
ga: Ról an Duine Shainithe

source: Where a person may need care, and because of ill-health, a physical disability or a mental condition, is unable to make an application for a care needs assessment, a specified person may apply for a care needs assessment on their behalf
ga: Sa chás go bhféadfadh go dteastódh cúram ó dhuine, agus mar gheall ar dhrochshláinte, ar mhíchumas fisiciúil nó ar riocht meabhrach, nach bhfuil siad in ann iarratas a dhéanamh ar mheasúnú ar riachtanais chúraim, féadfaidh duine sainithe iarratas a dhéanamh ar mheasúnú riachtanas ar a son

source: Where a person has reduced ability to make decisions (that is, diminished mental capacity), the specified person may also make the application for State support on their behalf
ga: Sa chás go bhfuil cumas laghdaithe ag duine chun cinntí a dhéanamh, is é sin, cumas laghdaithe meabhrach, féadfaidh an duine sainithe an t-iarratas a dhéanamh ar thacaíocht Stáit ar a son, chomh maith leis sin

source: A specified person is:
ga: Is éard is duine sainithe:

source: If you are a ward of court, your Committee
ga: Más coimircí cúirte thú, do Choiste

source: A person appointed under a valid, registered enduring power of attorney who is not restricted from applying for the scheme
ga: Duine a cheaptar faoi chumhacht sheasmhach bhailí chláraithe aturnae nach bhfuil srian air/uirthi ó iarratas a dhéanamh ar an scéim

source: A Care Representative appointed under the Nursing Homes Support Scheme Act 2009
ga: Ionadaí Cúraim arna cheapadh faoin Acht fán Scéim um Thacaíocht Tithe Banaltrais, 2009

source: Your spouse or partner,
ga: Do chéile nó do pháirtnéir

source: A relative of yours who is 18 years of age or over
ga: Gaol leat atá 18 mbliana d’aois nó níos sine

source: A ‘next friend’ appointed by a court
ga: ‘Neaschara’ arna cheapadh ag cúirt

source: Your legal representative, or
ga: D’ionadaí dlí, nó

source: A registered medical practitioner, nurse or social worker
ga: Liachleachtóir, altra nó oibrí sóisialta cláraithe

source: The people listed at A-C have first priority over those listed at D-H
ga: Déantar céadtosaíocht de na daoine a liostaítear ó A go C thuas tharstu siúd ó D go H

source: This means that they have the right to act as a specified person ahead of the other categories
ga: Ciallaíonn seo go bhfuil an ceart acu feidhmiú mar dhuine sainithe chun tosaigh ar na catagóirí eile

source: However, the people listed at A-C may consent in writing to a person with lesser priority acting as the specified person
ga: Féadfaidh na daoine a liostaítear ó A go C, áfach, toiliú a thabhairt i scríbhinn do dhuine ag a bhfuil tosaíocht níos lú chun feidhmiú mar an duine sainithe

source: Where a person has reduced ability to make decisions and wishes to apply for the Nursing Home Loan, only the people listed at A-C above may make the application
ga: Sa chás go bhfuil cumas laghdaithe ag duine chun cinntí a dhéanamh agus más mian leo iarratas a dhéanamh ar an Iasacht Teach Altranais, ní féidir ach na daoine a liostaítear ó A go C an t-iarratas a dhéanamh

source: Where your assets include land and property, the contribution based on these may be deferred until after your death
ga: Sa chás go n-áirítear le do shócmhainní talamh agus réadmhaoin, féadtar an ranníocaíocht 5% bunaithe orthu seo a iarchur go dtí an tráth tar éis do bháis

source: If you are approved for the Nursing Home Loan, the HSE will pay the money to the nursing home on your behalf and it will be collected after your death
ga: Má dhéantar tú a fhaomhadh don Iasacht Teach Altranais, íocfaidh FSS an t-airgead leis an teach altranais ar do shon agus baileofar é i ndiaidh do bháis

source: In certain circumstances the payment may be deferred for a longer period, for example, if a spouse or partner or your former carer is still living in your principal private residence
ga: Faoi chúinsí áirithe, féadtar an íocaíocht a iarchur ar feadh tréimhse níos faide, mar shampla, má tá céile nó páirtnéir nó d’iarchúramóir fós ina gcónaí i do phríomháit chónaithe

source: You can apply for the Loan when you first apply for the Nursing Homes Support Scheme or at any stage while resident in the nursing home
ga: Féadfaidh tú iarratas a dhéanamh ar an Iasacht nuair a dhéanann tú iarratas den chéad uair ar an Scéim Tacaíochta do Thithe Altranais nó ag an tráth fad a bhíonn cónaí ort sa teach altranais

source: In order to apply for the Nursing Home Loan you must provide written consent to having a Charging Order registered against your asset
ga: D’fhonn iarratas a dhéanamh ar an Iasacht Teach Altranais, ní mór duit toiliú i scríbhinn a chur ar fáil go ndéanfar Ordú Muirir a chlárú i leith do shócmhainní

source: If you are part of a couple, your spouse/partner must also provide written consent
ga: Más duine lánúine thú, ní mór do do chéile/pháirtnéir toiliú i scríbhinn a chur ar fáil chomh maith

source: The Charging Order is a simple type of mortgage which secures the money loaned by the HSE
ga: Saghas simplí de mhorgáiste atá i gceist leis an Ordú Muirir a chuireann an t-airgead a thugann FSS ar iasacht faoi urrús

source: Subject to your consent, the HSE is responsible for making the Charging Order, registering it against your asset and making Nursing Home Loan payments on your behalf
ga: Faoi réir do thoilithe, tá FSS freagrach as an Ordú Muirir a dhéanamh, é a chlárú i leith do shócmhainní agus íocaíochtaí Iasacht Teach Altranais a dhéanamh ar do shon

source: You will not need to do anything (although the HSE may need to check with you about the information in your application)
ga: Ní bheidh gá duit aon rud a dhéanamh (cé gur seans go mbeidh ar FSS dul i dteagmháil leat chun an fhaisnéis i d’iarratas a sheiceáil)

source: If a person does not have the capacity to consent to the Nursing Home Loan and the Charging Order, a Care Representative will need to be appointed to act on his/her behalf
ga: Mura mbíonn sé de chumas ar dhuine toiliú a thabhairt don Iasacht Teach Altranais agus don Ordú Muirir, beidh gá le hIonadaí Cúraim a cheapadh chun feidhmiú ar a s(h)on

source: The legislation underpinning the Scheme sets out specific timeframes for repayment of the loan (depending on what has caused the repayment to arise)
ga: Leagtar amach sa reachtaíocht atá mar bhonn agus taca leis an Scéim amfhrámaí sonracha chun an iasacht a aisíoc (ag brath ar céard ba chúis leis an aisíocaíocht)

source: As long as the repayment is made within the specified timeframes (that is, 12 months where repayment arises because the person in the nursing home has passed away and 6 months if the property is sold or transferred), interest does not have to be paid
ga: A fhad agus a dhéantar an aisíocaíocht laistigh de na hamfhrámaí sonraithe (is é sin, 12 mhí sa chás go n-eascraíonn an aisíocaíocht mar gheall go bhfuair an duine sa teach altranais bás agus 6 mhí má dhíoltar an réadmhaoin nó má aistrítear í), ní gá ús a íoc

source: If, however, repayment is not made within the specified timeframes, interest applies and the HSE will apply the Consumer Price Index to the loan to take account of the time value of money (that is, inflation or deflation) since the loan was made
ga: Mura ndéantar aisíocaíocht laistigh de na hamfhrámaí sonraithe, áfach, beidh ús i gceist agus cuirfidh FSS an Praghasinnéacs Tomhaltóirí i bhfeidhm ar an iasacht chun luach ama an airgid a chur i gcuntas (is é sin, boilsciú nó díbhoilsciú) ó rinneadh an iasacht

source: The Revenue Commissioners notify people in advance of the deadlines of the need to pay on time so as to avoid paying interest
ga: Cuireann na Coimisinéirí Ioncaim daoine ar an eolas, roimh na spriocdhátaí, gur gá dóibh íocaíocht a dhéanamh in am trátha d’fhonn íocaíocht úis a sheachaint

source: For more information on repayment of the Nursing Home Loan, see FAQs on the Nursing Homes Support Scheme (pdf)
ga: Chun teacht ar thuilleadh faisnéise faoi aisíocaíocht na hIasachta Teach Altranais, féach Ceisteanna coitianta ar an Scéim Tacaíochta do Thithe Altranais (pdf)

source: A Care Representative is only required where a person has reduced capacity to make certain decisions (that is, diminished mental capacity) and wishes to apply for the Nursing Home Loan
ga: Ní theastaíonn Ionadaí Cúraim ach amháin nuair a bhíonn cumas laghdaithe ag duine chun cinntí áirithe a dhéanamh (is é sin, cumas laghdaithe meabhrach) agus gur mian leo iarratas a dhéanamh ar an Iasacht Teach Altranais

source: The Care Representative is appointed by the Circuit Court
ga: Ceapann an Chúirt Chuarda an tIonadaí Cúraim

source: Their role is to act on behalf of the person in respect of the Nursing Homes Support Scheme and especially in respect of the Nursing Home Loan
ga: Is é an ról atá acu feidhmiú ar son an duine i dtaca leis an Scéim Tacaíochta do Thithe Altranais agus go háirithe maidir leis an Iasacht Teach Altranais

source: They can also act on behalf ofthe person in relation to making an application for a Care Needs Assessment, State support, or any other matter relating to the scheme
ga: Ina theannta sin, féadfaidh siad feidhmiú ar son an duine maidir le hiarratas a dhéanamh ar iarratas ar Mheasúnú ar Riachtanais Chúraim, tacaíocht Stáit, nó aon ábhar eile lena mbaineann an scéim

source: The list of people who can apply to be a Care Representative is set out below
ga: Leagtar amach thíos an liosta daoine ar féidir leo bheith ina nIonadaí Cúraim

source: Proof of diminished mental capacity
ga: Cruthúnas i leith cumas laghdaithe meabhrach

source: A person is considered to be of diminished mental capacity if, in relation to a decision on applying for the Nursing Home Loan and consenting to the Charging Order, he or she is unable:
ga: Meastar go bhfuil cumas laghdaithe meabhrach ag duine má, maidir le cinneadh ar iarratas a dhéanamh ar an Iasacht Teach Altranais agus toiliú a thabhairt don Ordú Muirir, ní féidir leis nó léi:

source: To understand the information relevant to the decision
ga: An fhaisnéis lena mbaineann an cinneadh a thuiscint

source: To retain that information
ga: An fhaisnéis sin a choinneáil

source: To use or weigh that information as part of the process of making the decision, or
ga: An fhaisnéis sin a úsáid nó a bhreithniú mar chuid de phróiseas déanta an chinnidh, nó

source: To communicate his or her decision (whether by talking, using sign language, communicating through a third party or any other means)
ga: Chun a c(h)inneadh a chur in iúl (cibé acu trí labhairt, teanga chomharthaíochta, cumarsáid a dhéanamh trí thríú páirtí nó trí aon bhealaí eile)

source: Two reports from two separate registered medical practitioners are required by the court as evidence that a person is of diminished mental capacity
ga: Teastaíonn dhá thuarascáil ó bheirt liachleachtóirí cláraithe ar leith ón gcúirt mar fhianaise go bhfuil cumas laghdaithe meabhrach ag duine

source: Persons who can apply for appointment as a Care Representative
ga: Daoine ar féidir leo iarratas a dhéanamh lena gceapadh mar Ionadaí Cúraim

source: The following persons, in order of priority, may apply to be appointed as a Care Representative once they are 18 years of age or over:
ga: Féadfaidh na daoine a leanas, in ord tosaíochta, iarratas a dhéanamh go gceapfar iad mar Ionadaí Cúraim a luaithe a bhíonn siad 18 mbliana d’aois nó níos sine:

source: Your brother or sister (whether a full or half sibling)
ga: Do dheartháir nó do dheirfiúr (cibé acu más siblíneach iomlán nó leathshiblíneach iad)

source: Your niece or nephew
ga: Do neacht nó do nia

source: A person who appears to the court to have a good and sufficient interest in your welfare, other than the owner of a nursing home in which you reside or are likely to reside or a medical practitioner who examined you and prepared a report for the court in relation to your capacity
ga: Duine ar dócha don chúirt go bhfuil dea-spéis agus spéis leordhóthanach acu i do leas, seachas úinéir teach altranais ina gcónaíonn tú nó inar dócha go mbeidh cónaí ort nó liachleachtóir a rinne scrúdú ort agus a réitigh tuarascáil don chúirt maidir le do chumas

source: Procedure for appointment as a Care Representative
ga: An nós imeachta um cheapachán mar Ionadaí Cúraim
